Revit 2024 API
StructuralSectionIWelded.WebHeight Property
 Web Height.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double WebHeight { get; set; }
Visual Basic
Public Property WebHeight As Double
	Get
	Set
Visual C++
public:
property double WebHeight {
	double get ();
	void set (double value);
}
See Also
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace